[{"id":"i1","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-001.png","alt":"SAAS image by prdnotes.com"},{"id":"h0","cnt":"What is SAAS?"},{"id":"t2","cnt":"SAAS stands for Software As A Service. In this model software companies host the infrastructure, and application onto a server and provide them to customers over the internet. Companies employ web-based software technologies which are hosted centrally on their servers. And customers can use the software based on their needs."},{"id":"t3","cnt":"SAAS is one of the three models for cloud services. The other two are PAAS (Platform As A Service), and IAAS (Infrastructure As A Service). The following diagram depicts the difference between the three."},{"id":"i4","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-002.png","alt":"SaaS vs PaaS vs IaaS image by prdnotes.com"},{"id":"t5","cnt":"Here is an example of companies operating on these three different models"},{"id":"o6","cnt":"SAAS: Dropbox, Salesforce, Cisco WebEx, Google Suite\nPAAS: AWS Elastic Beanstalk, Windows Azure, Heroku, Google App Engine\nIAAS: DigitalOcean, Rackspace, Amazon Web Services (AWS)"},{"id":"t7","cnt":"The closest analogy to a SAAS model is off hosting a room on Airbnb. An upfront investment into the room is done to make the living experience competitive to that of a hotel, and expect regular payment from bookings in the future. The owner needs to carry out regular cleaning and maintenance to maintain the room for maintaining the customers."},{"id":"h9","cnt":"Origin of SAAS"},{"id":"t8","cnt":"SAAS was just a small part of a much bigger phenomenon that has shifted the software business from the 90’s licensing model to a service-based model i.e rise of the cloud economy. With the internet, high computing power, and low infrastructure cost, it became inevitable to consume-on-demand."},{"id":"t10","cnt":"The inception of SAAS began with Salesforce. Salesforce is a CRM software that automates the company's internal process in exchange for a monthly fee. Marc Benioff, the founder of Salesforce, incorporated the company in Delaware in Feb 1999. The objective was clear, to offer service at low cost, easy-to-use, and quick to deploy. It also brings an impeccable advantage of multi-device usage."},{"id":"i11","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-003.png","alt":"key features of saas image by prdnotes.com"},{"id":"h12","cnt":"How to make money in SAAS?"},{"id":"t13","cnt":"SAAS businesses have broadly two distinct sources of revenue, (1) subscription revenue, which is a subscription fee for on-demand application service, and for purchasing additional support beyond the package quota. (2) Professional services which mainly consist of training fees. Here is the revenue breakdown of Salesforce for the first 4 years since inception.\n"},{"id":"i14","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-005.png","alt":"SAAS revenue breakdown image by prdnotes.com"},{"id":"t15","cnt":"Depending on the business model, SAAS business structures their pricing model on quotas, Accessibility to features, and a hybrid of the above two. This enables them to have a segmented pricing scheme which helps them to leu-in different categories of users. Salesforce had segmented it’s on-demand CRM service into three editions"},{"id":"t16","cnt":"Enterprise Edition, which is our most fully-featured offering and which is targeted at large companies that have several different divisions or departments;"},{"id":"t17","cnt":"Professional Edition, which is targeted at medium-sized and large businesses that need a robust CRM solution but does not need some of the more advanced features and integration capabilities of Enterprise Edition; and"},{"id":"t18","cnt":"Team Edition, which is targeted primarily at small businesses that seek a robust sales force automation solution without the more sophisticated features of our other editions."},{"id":"h19","cnt":"What is different about SAAS?"},{"id":"t20","cnt":"In SAAS or any other recurring revenue businesses, the revenue for services is earned over a duration. If a customer is happy with the service, the customer tends to stay for a longer duration resulting in an increase in profit from that customer. If a customer is unhappy, he will churn out and the business will lose its return on the investment it made on acquiring that customer. In the SAAS model, a business has to focus on two different sales:"},{"id":"o21","cnt":"Sales to acquire new customers\nSales to retain existing customers"},{"id":"t22","cnt":"To understand more about the SAAS business, let's gaze through the financials of Salesforce. The following table shows the data from the first four years of businesses, furnished by salesforce to SEC. The following graph shows that marketing & sales had always been more than 50% of the total operating expense after the year of inception (1999-2000)."},{"id":"i23","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-004.png","alt":"SAAS operating expense breakdown image by prdnotes.com"},{"id":"t24","cnt":"The marketing expenses for Salesforce consist primarily of salaries and related expenses of their sales and marketing staff, sale commission, payment to partners, marketing events, corporate communication, advertising. The company invested heavily in its direct sales staff to drive customer acquisition."},{"id":"t25","cnt":"Apart from direct sales, SAAS business should explore other channels of lead generation. A detailed analysis by Mike Sonder on his blog reveals that organic search, referrals, email marketing, and social media marketing collectively contribute more than 40% to website traffic."},{"id":"h26","cnt":"Importance of research and development in SAAS"},{"id":"t27","cnt":"Research and development of new offerings play a key role in increasing the life-time value of the customer. Customer lifetime value (CLTV) represents the total amount of money a customer spends on your products, during their life. (We will learn more about CLTV in the following sections)"},{"id":"t28","cnt":"The development of new offerings opens doors for up-selling and cross-selling which leads to an increase in share-of-wallet of the customer and an increase in avg. revenue per customer, directly impacting the CLTV. Salesforce kept on investing heavily in R&D despite their first success. Companies should also invest in R&D to optimize existing services to accommodate the increasing influx of users."},{"id":"h29","cnt":"Measuring success in SAAS"},{"id":"t30","cnt":"As mentioned in the above sections, the success of SAAS depends on acquiring new customers and retaining existing customers. And this is made possible, every time your software delivers value on logging in just like a debit card."},{"id":"t31","cnt":"Measuring such a dynamic business is a difficult task. But thanks to David Skok for putting things into perspective on how to manage a SAAS business model. Let's hear what he has to say about SAAS business metrics."},{"id":"v32","cnt":"https://www.youtube.com/embed/5RR6M_d6eKc"},{"id":"t33","cnt":"Let’s start by looking at macro-level goals, and then trickling down from there into the micro. There are four key goals which we need to measure for, that are profitability, cash, growth, and others(like the cost to serve, market share, etc.)"},{"id":"i34","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-006.png","alt":"SAAS key goals image by prdnotes.com"},{"id":"h35","cnt":"Profitability"},{"id":"t36","cnt":"Profitability is a key indicator to measure the success of every business and is revenue minus the expenses. This simple calculation does not give us an entire picture of profitability in the SAAS model. Hence, we extend it out to three categories i.e profitability per customer, profitability per employee, and overall business profitability."},{"id":"i37","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-007.png","alt":"SAAS profitability breakdown image by prdnotes.com"},{"id":"t38","cnt":"To measure the profitability per customer we calculate the cost of acquiring customers(CAC) and lifetime value of the customer(CLTV). CAC is the total of a company’s spend in sales and marketing to convert a lead into a paying customer."},{"id":"t39","cnt":"Hence, CAC is affected by your sales funnel conversion and your marketing & sales cost which includes your marketing programs, number of touches required (example number of visits made by the sales executive to convert a lead to a paying customer), and personalization cost."},{"id":"i40","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-008.png","alt":"SAAS profitability per customer breakdown image by prdnotes.com"},{"id":"t41","cnt":"CLTV represents the total amount of money a customer spends on your products, during their life. The CLTV is calculated using the following equation."},{"id":"t42","cnt":"CLTV = ARU x Avg. customer lifetime - COGS"},{"id":"t43","cnt":"Avg. customer lifetime is calculated by 1/churn rate. Churn rate is the percentage of customers unsubscribing your SAAS service. For example, if you have an annual subscription model and 50% of the customers do not re-subscribe, then your avg. customer lifetime is 1 divided by 50% i.e. 2 years. If your churn rate is high, it is a clear indication of low customer satisfaction."},{"id":"t44","cnt":"And the third component of the equation is COGS (cost of goods sold or cost to serve them). COGS is the direct cost of producing goods or services sold by the company. You will have a great SAAS business if CLTV is far greater than CAC. The thumb rule is, CLTV should be three times CAC."},{"id":"t45","cnt":"Profitability per employee is key in measuring the productivity of your workforce. Profitability per employee is equal to the annual profit/ no of employees. And then compare this ratio across the industry."},{"id":"i46","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-009.png","alt":"SAAS profitability per employee breakdown image by prdnotes.com"},{"id":"t47","cnt":"Revenue divided by no of employees is another ratio that you can compare across industry standards to measure your performance. The other half of looking into your workforce productivity is by calculating expense per employee."},{"id":"t48","cnt":"In a SAAS model, the focus is not just on annual revenue achieved by the company, but also on the recurring revenue. For example, if a customer left your service in the middle of the year, he had contributed to your annual revenue but you have lost the recurring revenue source."},{"id":"t49","cnt":"Recurring revenue can be measured monthly called Monthly Recurring Revenue(MRR) or annually called Annual Recurring Revenue(ARR). The ARR (or MRR) is calculated by adding new ARR plus expansion ARR and subtracting churn ARR."},{"id":"t50","cnt":"New ARR corresponds to the new customers added in the current financial year. Expansion ARR corresponds to the existing customers who expanded their subscription and churn ARR corresponds to customers who have canceled the subscription."},{"id":"i51","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-010.png","alt":"ARR calculation image by prdnotes.com"},{"id":"h52","cnt":"Cash"},{"id":"t53","cnt":"Cash involves two key measurements. First, the number of months of revenue to be earned from the customer to recover CAC. Second, is cash flow. The lower the number of months to recover CAC, the better profitability of the business. The ideal count is 12 months."},{"id":"i54","lnk":"https://ik.imagekit.io/prdnotes/bt0/bt-000-011.png","alt":"SAAS cash breakdown image by prdnotes.com"},{"id":"t55","cnt":"Positive cash flow is a must to have for any business or you will run out of cash soon. One of the ways SAAS companies ensure positive cash flow is by charging the subscription fee upfront for the services offered, deferred over the subscription period. This is a great strategy as it helps you generate cash to fund future growth."},{"id":"h56","cnt":"Growth"},{"id":"t57","cnt":"Once the company establishes itself, the focus should move on growing the business. The growth of the SAAS business is ensured by three factors,"},{"id":"o58","cnt":"increase in deal conversion\nIncrease in deal size\nAdding new products to upsell or cross-sell"},{"id":"t59","cnt":"The most practiced strategy to increase deal conversion is by discovering more effective channels for lead generation. Some of the channels used by the top SAAS companies like Salesforce, ServiceNow, Shopify, Workdays, etc. are following,"},{"id":"u60","cnt":"Organic search\nReferrals\nE-mail\nSocial media\nDigital advertising"},{"id":"t61","cnt":"Mike Sonders has done an in-depth analysis of the above sources of traffic. As per his research, organic search is the single biggest source of traffic for the top 50 SAAS businesses by revenue (Driving up to 77% of the traffic). For some companies, referrals can account for up to 48% of the traffic. Email contributes roughly 5% to the traffic."},{"id":"t62","cnt":"In social media, Youtube has surpassed Facebook for SAAS companies. Digital advertising is seeing much attention from SAAS companies. About 96% of the companies are running display ads in Dec 2019, up from 72% in Jan 2019."},{"id":"h64","cnt":"Others"},{"id":"t63","cnt":"Some of the other metrics to focus on are support cost, R&D, market share, etc. Support cost can be viewed by breaking it down into the number of incidents and cost per incident, where an incident is the service ticket raised by the customer."}, {"id": "meta","tle": "SAAS Business Model","des": "Explore the nitty-gritty of SAAS with prdnotes. The articles covers the revenue models, operating expenses and how to measure success in SAAS business","img": "https://ik.imagekit.io/prdnotes/bt0/bt-000-001.png","url": "https://prdnotesdotcom.web.app/business/bt0"}]