[{"id":"i1","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-001.png","alt":"design thinking image by prdnotes.com"},{"id":"h0","cnt":"What is design thinking and why?"},{"id":"t2","cnt":"Design thinking is an iterative process to understand users and redefine problems to devise strategies and solutions which may not appear with the current level of comprehension."},{"id":"t3","cnt":"In contrast to the quality movement, where the practitioners focus on reducing the variables to solve a problem, design thinking practitioners focus on increasing variables to increase the number of possible solutions."},{"id":"t4","cnt":"To answer why we need design thinking, let's focus on what are the different types of problems and what kind of strategies we have to solve those problems. Broadly the problems can be classified into 4 categories that are tame problems, business problems, research problems, and wicked problems."},{"id":"h6","cnt":"Four kinds of thinking"},{"id":"v5","cnt":"https://www.youtube.com/embed/q7LRxKHdao8"},{"id":"t7","cnt":"For each kind of problem, we humans have developed a way of thinking. Tame problems are well defined, and well-behaved problems that are solved by engineering thinking. For example, building a bridge is a tame problem for which we know the solution, and are aware of the variables which can affect the outcome."},{"id":"t8","cnt":"We exercise optimization thinking for business problems. For example, the search rank of a webpage is increased through search engine optimization (SEO). SEO is an iterative process in which we build upon the existing foundation."},{"id":"t9","cnt":"Developing a COVID-19 vaccine is a great example of a research problem. To develop a solution, scientists develop samples of a vaccine in the labs by examining the genome and then perform experiments to reach conclusive evidence on the effectiveness of the vaccine. This approach involves analytical thinking."},{"id":"t10","cnt":"At last, we have hard to define, and complex problems like global warming, food security, etc. which are referred to as wicked problems. For so, we have design thinking. Let us review the following video to know more about the types of problems."},{"id":"h12","cnt":"What are wicked problems?"},{"id":"t11","cnt":"Automobiles contribute 10% to global CO2 emissions. Shifting to electric vehicles will reduce the CO2 emissions from automobiles, thanks to Elon Musk. But did you know most of the electricity is produced by thermal power plants which run on coal? This is the reason why global warming is a wicked problem."},{"id":"v13","cnt":"https://www.youtube.com/embed/lOKpB4KtUZ8"},{"id":"t14","cnt":"Wicked problems are hard to define, complex, interconnected with other problems, have a lot of opinions associated with them, and have many possible solutions. We have inadequate information on the wicked problem which makes it difficult to define and solve. Think of the team that designed the first mouse and pointer for our personal computers. They answered questions like one button or two; left-click or right-click; double click or a single click. There was no right or wrong answer, all were possibilities."},{"id":"t15","cnt":"We can never solve the entire wicked problem and so we take it piece by piece. By solving a wicked problem, we can seldom end up with another problem."},{"id":"h16","cnt":"Obstacles to design thinking"},{"id":"t17","cnt":"As we had defined earlier that design thinking is an iterative process and is exercised by teams. Design thinking demands mindset and teamwork And the following factors are obstacles to the proper mindset and teamwork."},{"id":"i18","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-002.png","alt":"Obstacles to design thinking image by prdnotes.com"},{"id":"t19","cnt":"Humans have an instinctive mentality to respond to stimuli. It is habitual to use our past learning, and experience to decipher solutions. Solving problems with a fresh mindset increases the number of potential solutions."},{"id":"t20","cnt":"In teamwork, egos are bound to come into play. ‘Boss is always right’ is a classic phrase that exhibits the play of egos. Remember, no solution is right or wrong until it is tested by the customer."},{"id":"t21","cnt":"The desire for harmony and conformity within a group is a behavioral tendency, and this phenomenon is called groupthink. Groupthink stops the flow of ideas and barricades free thinking. To avoid groupthink, form a team of people from diverse backgrounds."},{"id":"t22","cnt":"To a man with a hammer, every problem looks like a nail. You cannot cure every disease with antibiotics, in the same way, every problem does not have the same solutions. This is why we are exercising design thinking."},{"id":"t23","cnt":"Incorrect problem definition can lead to the wrong solution. Solving for symptoms does not eradicate the problem. Analyzing and synthesizing correct problem statements is essential to problem-solving. Don’t get trapped by the illusion of whether it's a cup or face."},{"id":"h26","cnt":"Design thinking process"},{"id":"i24","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-003.png","alt":"design thinking process image by prdnotes.com"},{"id":"t25","cnt":"The design thinking process is divided into 5 stages presented in the chronological order as shown in the figure. It is a non-linear process. A design thinking practitioner goes back and forth across all these five stages."},{"id":"h28","cnt":"Empathize"},{"id":"i30","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-004.png","alt":"image by prdnotes.com"},{"id":"t27","cnt":"In this stage, we strive to empathize with the target users to understand his world view, appreciate his feelings, and observe his actions. This educates us about the user's behavior, perception, priorities, daily routine, habits, and what drives those habits.  But before we move on, let’s understand the difference between empathy vs sympathy."},{"id":"v29","cnt":"https://www.youtube.com/embed/1Evwgu369Jw"},{"id":"t31","cnt":"Some of the popular methods to empathize are, "},{"id":"u32","cnt":"Start with a beginner’s mindset\nAsk questions\nCreate journals\nInteract with extreme users."},{"id":"i33","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-005.png","alt":"techniques to empathize in design thinking image by prdnotes.com"},{"id":"t34","cnt":"Interview your users with a beginner’s mindset. A beginner's mindset is free from assumptions, preconceptions, and judgment. What your user is saying, absorb it like a sponge. Try to record it in a notebook or make a video for later reference."},{"id":"t35","cnt":"Ask questions to probe into the user's mind will reveal their way of thinking. I remember working with Massey Ferguson in finalizing the designs of the marketing collateral for the launch of their launch. By probing farmers we learned that the size of the rear wheel of the tractor is directly correlated with the perceived power of the tractor. Apply methods like 4W1H (what, when, where, who, and how) or why-why analysis to drill deep into your users' mindset."},{"id":"t36","cnt":"Document your findings after every interview in a journal is also a good strategy. These journals are very helpful for later reference. You can even take-up peculiar observations in future interviews for cross-validation."},{"id":"t37","cnt":"For a door manufacturer who ignores the population of dwarfs or giants, it will become difficult to finalize the size of the door and the height of the door handle. It is not about having a different model for them, but it is about considering their viewpoint which may lead to remarkable insights."},{"id":"h38","cnt":"Define"},{"id":"i40","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-006.png","alt":"Define stage of design thinking image by prdnotes.com"},{"id":"t39","cnt":"After understanding our users, we shift our focus on defining their problem. We define problems through analyzing and synthesizing. Analyzing is the process of breaking down the findings into smaller, easy to understand constituents. Synthesis is the process of putting all pieces together to see the complete picture."},{"id":"t41","cnt":"Some of the techniques to define problems are,"},{"id":"u42","cnt":"Space saturate & group\nEmpathy mapping\nPOV problem statements\nHow might we…? statements\nHow-why laddering."},{"id":"i43","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-007.png","alt":"Techniques to define problem in design thinking image by prdnotes.com"},{"id":"t44","cnt":"In space saturate & grouping we list down all the key observations on a post-it note(one observation on one post-it note). Next, we group the key observations into categories. This way we narrow down to key problems."},{"id":"t45","cnt":"In empathy mapping, we have a matrix framework where each quadrant represents what the user said, did, though, and felt. We organize our observations into each quadrant to manifest a meaningful understanding of the user."},{"id":"t46","cnt":"“An architect is searching for software to digitize his old paper layouts.” This is a great example of a POV statement. It tells us that our user is an architect who is searching(verb) for software to digitize old paper layouts(this is our insight)."},{"id":"t48","cnt":"How might we …? statements are very helpful in defining problems in a single line like “How might we stop stubble burning in developing countries?” How-why laddering is another approach to drill deep in a specific behavior or action. E.g. You can ask the user how he goes to the office and then asks a series of why for the reasoning."},{"id":"h49","cnt":"User persona"},{"id":"t51","cnt":"After defining the problem and understanding your users the next challenge is of sharing and communicating the findings with your team members who were not part of the process. "},{"id":"t53","cnt":"One of the methods adopted by design thinkers is creating user personas. A user persona is a fictional character that resembles your user. By sharing a user persona, you will encounter minimal resistance and high acceptance. "},{"id":"i52","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-014.jpg","alt":"image by prdnotes.com"},{"id":"h50","cnt":"Ideate"},{"id":"t54","cnt":"We will break down this stage into two steps. In step one, we work on generating ideas and in step two we shortlist from those ideas. Both steps demand teamwork. It is desirable to have a multidisciplinary team for better outcomes. The ideal team strength is from 3-6 members."},{"id":"t56","cnt":"The best practices to ideate are,"},{"id":"o55","cnt":"Set a time limit for the secession\nStart with a problem statement, goal, and stay focused\nStay on the topic\nDefer judgment or criticism\nEncourage weird, wacky and wild ideas\nAim for quality\nBuild on each other's idea\nBe Visual\nOne conversation at a time."},{"id":"t57","cnt":"Here is a video from IDEO showing idea generation"},{"id":"v58","cnt":"https://www.youtube.com/embed/VvdJzeO9yN8"},{"id":"t59","cnt":"It is recommended to have a separate environment for idea generation and idea shortlisting e.g. do both the activities in separate rooms. After idea generation, move to shortlisting of ideas. The following are the 3 most useful techniques to shortlist ideas for prototyping."},{"id":"u60","cnt":"Post-it Voting\nFour category method\nNow, wow, how matrix"},{"id":"i61","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-008.png","alt":"techniques to shortlist ideas image by prdnotes.com"},{"id":"t62","cnt":"Post-it voting is an effective way to shortlist ideas. Every team member has a limited number of votes. He will cast votes for the ideas he/she likes and the post-it with the maximum votes wins. Re-conduct the activity until you end up with one or two ideas to prototype. "},{"id":"t63","cnt":"In four-category methods, all the ideas are classified into four categories that are rational, delightful, darling, and long shot. The Prototyping of ideas is also taken up in the same order."},{"id":"t64","cnt":"Now, Wow, How matrix is used to gauge the idea on two parameters, 1) originality, 2) ease of implementation. The ideas that are normal, and easy to implement are taken first hence NOW. The second priority is for ideas that are original, and easy to implement classified as WOW. And the last priority is for ideas that are original, and difficult to implement classified as HOW."},{"id":"h65","cnt":"Prototype"},{"id":"t67","cnt":"The prototype is the stage where you give a form to your idea with which your user can interact and give feedback. The main motto of the prototype phase is to fail fast and cheap. Hence, a team should not spend too much time deliberating how to build instead just start building."},{"id":"i68","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-009.png","alt":"low-fidelity prototype vs high-fidelity prototype image by prdnotes.com"},{"id":"t69","cnt":"Prototypes can be of two types, 1) low-fidelity prototype, and 2) high-fidelity prototype. A low fidelity prototype is like a sketch of a webpage, it gives an idea of how the final product will look like. They are easy and quick to make and promote open-ended discussion which is great for discovery."},{"id":"t70","cnt":"The high-fidelity prototypes are a close resemblance to the final product. It is an outcome of interactions on the low-fidelity prototype. With each iteration, you get one step closer to the final product. To build a successful prototype, you can follow 4 key guidelines."},{"id":"i74","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-010.png","alt":"guidelines to prototype image by prdnotes.com"},{"id":"t73","cnt":"First, just start building. Do not think too much about how to build, or which is the best technique. Remember, prototypes are for your user, not a medium for you to display your creative skills. Second, do not spend too much time building. Recall our motto, fail fast, and cheap. Third, remember what you are testing for. Only focus on incorporating relevant features. And last, build with users in mind. Make something that users can interact with."},{"id":"i76","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-011.png","alt":"techniques to prototype image by prdnotes.com"},{"id":"t77","cnt":"Some of the way to build prototype are,"},{"id":"u78","cnt":"Sketching\nWireframing\n3-D printing\nOrigami\nlego type toys"},{"id":"h75","cnt":"Test"},{"id":"i80","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-012.png","alt":"image by prdnotes.com"},{"id":"t79","cnt":"In the test phase, we focus on testing the interaction between the user, prototype, and environment. We should focus on both verbal and non-verbal gestures. Capturing video of users using your prototype is of great knowledge and value. The key guidelines to test are"},{"id":"o82","cnt":"Let your users compare the prototypes\nShow, do not tell. Let users experience the prototype\nAsk users to talk while experiencing the prototype\nObserve users how correctly or incorrectly use your prototype\nAsk follow-up questions. It is best to have a list of questions ready beforehand."},{"id":"v86","cnt":"https://www.youtube.com/embed/ELYVpikRNEE"},{"id":"h83","cnt":"The outcome of design thinking"},{"id":"i85","lnk":"https://ik.imagekit.io/prdnotes/dt0/dt-000-013.png","alt":"Outcome of design thinking image by prdnotes.com"},{"id":"t84","cnt":"After going through the design thinking process, there should be an increase in understanding of the problem and have an idea of a workable solution (product or service) that can counter-attack the problem. Our solution should be desirable for the users, viable for the technology to implement, and feasible for the business to sell and scale."},{"id":"meta","tle":"Design Thinking","des":"Design solutions to complex problems with design thinking. Click to learn about design thinking and how to apply it. An interactive article comprising of text, images and videos... ","img":"https://ik.imagekit.io/prdnotes/dt0/dt-000-001.png","url":"https://prdnotesdotcom.web.app/design/dt0"}]